Repository: Andre9642/goldenCursor
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fa, pt_br

source: Enter the value for position number you wish to jump to
ar: أدخلْ القيمة التي تريد الانتقال اليها.
fa: شماره‌ی موقعیتی را که میخواهید به آنجا بروید وارد کنید.
pt_br: Insira o valor do número da posição para a qual deseja pular

source: please enter comma between the first and the second number
ar: من فضْلِكَ افْصِلْ ما بين x وَ y بفاصلة.

source: Error
ar: خطأ!
fa: خطا
pt_br: Erro

source: please enter an integer number.
ar: من فضلك أَدْخِلْ رقم صحيح .
fa: لطفا یک عددِ صحیح وارد کنید.
pt_br: Por favor insira um número inteiro.

source: This key Not used.Press h for Help
ar: هذا المفتاح غير مستخدم اضغط h للمساعدة.

source: to select a value for mouse movement (1, 10, 20, 50. 100.
ar: لتحديد قيمة البكسل. ما بين 1 . 5 . 10 . 20 . 50 . 100.
fa: جهتِ انتخاب یک مقدار برای حرکت موس از میانِ مقادیرِ ۱، ۵، ۱۰، ۲۰، ۵۰ و ۱۰۰ پیکْسِل.
pt_br: selecionar um valor para o movimento do mouse (1, 10, 20, 50, 100)

source: report pixels off
ar: الاعلان عن البكسل.تعطيل.
fa: پیکْسِل‌ها اعلام نمیشوند.
pt_br: desligado anúncio de píxels

source: report pixels on
ar: الاعلان عن البكسل .تشغيل.
fa: پیکْسِل‌ها اعلام میشوند.
pt_br: ligado anúncio de píxels

source: Moves the Mouse pointer right.
ar: تحريك المؤشر لليمين.
fa: اشاره‌گرِ موس را به راست میبَرَد.
pt_br: Move o ponteiro do mouse para a direita.

source: Moves the Mouse pointer left.
ar: تحريك المؤشر لليسار.
fa: اشاره‌گرِ موس را به چپ میبَرَد.
pt_br: Move o ponteiro do mouse para a esquerda.

source: Moves the Mouse pointer up.
ar: تحريك المؤشر للأعلى.
fa: اشاره‌گرِ موس را بالا میبَرَد.
pt_br: Move o ponteiro do mouse para cima.

source: Moves the Mouse pointer down.
ar: تحريك المؤشر للأسفل.
fa: اشاره‌گرِ موس را پایین میبَرَد.
pt_br: Move o ponteiro do mouse para baixo.

source: restriction on
ar: حصر المؤشر تشغيل.
fa: موس محدود شد.
pt_br: ligada restrição

source: restriction off
ar: حصر المؤشر تعطيل.
fa: موس محدود نیست.
pt_br: desligada restrição

source: Toggles the restriction between the 2 levels you can toggle between Application Window restriction and Unrestricted.
ar: تبديل لحَصر المؤشر في نافذة التطبيق النشط.
fa: محدودیتِ موس را بینِ دو سطح تغییر میدهد. شما میتوانید اشاره‌گرِ موس را محدود به پنجره‌ی جاری کنید یا محدودیتِ موس را بردارید.
pt_br: Alterna a restrição entre dois níveis; você pode alternar entre restrição à janela do aplicativo e não-restrito.

source: Jump to position
ar: الانتقال الى.
fa: پریدن به موقعیت
pt_br: Pular para a posição

source: report the positions of the mouse.
ar: الاعلان عن البكسل لموضع الفأرة الحالي.
fa: موقعیتِ موس را اعلام میکند.
pt_br: anuncia as posições do mouse.

source: toggle reporting of pixels
ar: التَّبْديل بين تشغيل وتعطيل الإعلان عن البكسل.
fa: اعلام شدنِ پیکْسِل‌ها را فعال یا غیرِ فعال میکند.
pt_br: alterna o anúncio de píxels

source: type the x/y value you wish the cursor to jump to
ar: لكتابةقيمة x, y لانتقال المؤشر اليها.
fa: مقدار X و Yِ موردِ نظرتان را که میخواهید اشاره‌گر به آنجا بپرد وارد کنید.
pt_br: Digite o valor x/y para o qual deseja que o cursor pule

source: please enter the value for the name of the position.
ar: اكتب اسماً للموضع الحالي.
fa: لطفا نامِ موقعیت را وارد کنید.
pt_br: por favor insira o valor para o nome da posição.

source: Enter the value for position name you wish to save.
ar: اكتب اسما للموضع الحالي.
fa: نامِ موقعیتی را که میخواهید ذخیره کنید وارد کنید.
pt_br: Insira o valor para o nome da posição que deseja salvar.

source: save position
ar: حفظ الموضع.
fa: ذخیره کردنِ موقعیت
pt_br: salvar posição

source: there is no saved data for this application.
ar: لا توجد أي بيانات محفوظة لهذا التطبيق حتى الآن.

source: list of positions
ar: قائمة بلمواضع المحفوظة.

source: choose a item of this list
ar: عرض العناصر.
fa: موردی را از این فهرست انتخاب کنید
pt_br: Escolha um item desta lista

source: ok
ar: موافق.

source: cancel
ar: الغاء.

source: To open a list showing the points that have already been saved for this application.
ar: لِفَتحِ قائمة تعْرِض الإحداثيات المُخَزَّنة لهذا التطْبيق.
fa: برای باز کردنِ فهرستی که نقاطِ ذخیره‌شده برای این برنامه را نشان میدهد.
pt_br: Abrir uma lista mostrando os pontos que já foram salvos para este aplicativo.

source: to save a the current position.
ar: لفتْحِ محاوَرة تتيح لكَ تخزين الموضع الحالي.
fa: برای ذخیره کردنِ موقعیتِ جاری.
pt_br: salvar a posição atual

source: the position had saved.
ar: تم حفظ الموضع.

source: rename
ar: اعادة تسمية.

source: delete
ar: حذف.

source: clear
ar: حذف نهائي.

source: you can rename this name.
ar: قم بإعادة التسمية؟

source: rename dialog
ar: محاورة لإعادة التسمية.

source: the list is empty.
ar: القائمة فارغة.

source: no selection
ar: لايوجد تحديد.
fa: چیزی انتخاب نشده است.
pt_br: sem seleção

source: positions List
ar: قائمة المواضع.
fa: فهرستِ موقعیت‌ها
pt_br: Lista de posições

source: there is no any positions for %s.
fa: موقعیتِ ذخیره‌شده‌ای برای %s موجود نیست.
pt_br: Não existem posições para %s.

source: &rename
fa: تغییرِ &نام
pt_br: &renomear

source: &delete
fa: &حذف کردن
pt_br: &apagar

source: c&lear
fa: &پاک کردن
pt_br: &esvaziar

source: Edit
fa: ویرایش
pt_br: Editar

source: Rename
fa: تغییرِ نام
pt_br: Renomear

source: the position has been deleted.
fa: موقعیت حذف شده است.
pt_br: posição foi apagada.

source: the list has been cleared.
fa: فهرست پاک شده است.
pt_br: lista foi esvaziada.

source: An NVDA settings dialog is already open. Please close it first.
fa: یک پنجره‌ی تنظیماتِ NVDA باز مانده است. لطفا اول آن‌را ببندید.
pt_br: Já está aberto um diálogo de opções do NVDA. Por favor feche-o primeiro.

source: the position has been saved in %s.
fa: موقعیت در %s ذخیره شده است.
pt_br: posição foi salva em %s.

source: please enter comma between the first and the second number
fa: لطفا بینِ شماره‌ی اول و دوم کاما بگذارید.
pt_br: Por favor insira uma vírgula entre o primeiro e o segundo números

source: Golden Cursor moves the mouse with the keyboard
fa: مکان‌نمای طلایی موس را با صفحه‌کلید حرکت میدهد.
pt_br: O cursor de ouro move o mouse pelo teclado

source: Allows you to control the mouse movement with the arrow keys. for further details please visit the addon guide help.
fa: به شما امکان میدهد حرکتِ اشاره‌گرِ موس را با جهت‌نماها کنترل کنید. برای جزئیات بیشتر راهنمای افزونه را ببینید.
pt_br: Possibilita controlar o movimento do mouse com as teclas de setas. Para mais detalhes por favor visite a ajuda do guia do complemento.
